---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.MacroFailures
source: html/d4b395d9-c663-e784-8bad-bfc330432774.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MacroFailures

Failures about module with duplicate name found during reload latest.

## Syntax (C#)
```csharp
public static class MacroFailures
```